In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Example: SQLite (change this to your DB)
engine = create_engine("sqlite:///mydatabase.db")

In [3]:
# Load CSV files into DataFrames
df1 = pd.read_csv("accounts.csv")
df2 = pd.read_csv("products.csv")
df3 = pd.read_csv("sales_pipeline.csv")
df4 = pd.read_csv("sales_teams.csv")

In [4]:
df1.sample(5)

,account,sector,year_established,revenue,employees,office_location,subsidiary_of
60,Scotfind,software,1996,6354.87,16780,United States,Bubba Gump
37,Inity,marketing,1986,2403.58,8801,United States,NaN
79,Yearin,retail,2005,2261.05,3851,United States,NaN
61,Scottech,marketing,2012,45.39,100,United States,Inity
70,The New York Inquirer,medical,1996,439.21,792,United States,NaN

In [5]:
df2.sample(5)

          product series  sales_price
3     MG Advanced     MG         3393
1         GTX Pro    GTX         4821
5  GTX Plus Basic    GTX         1096
4    GTX Plus Pro    GTX         5482
6         GTK 500    GTK        26768

In [6]:
df3.sample(5)

,opportunity_id,sales_agent,product,account,deal_stage,engage_date,close_date,close_value
3061,Q9GJ1LJT,Daniell Hammack,MG Advanced,Plussunin,Lost,2017-05-10,2017-09-03,0.0
1033,ERYLM04D,Cecily Lampkin,MG Advanced,Funholding,Won,2017-02-23,2017-05-23,3668.0
3045,Q0MRZHN7,Maureen Marcano,MG Special,Konex,Won,2017-05-09,2017-05-12,57.0
2291,EUKD4Z0V,Reed Clapper,GTXPro,Plussunin,Lost,2017-04-10,2017-04-16,0.0
2688,GM6C1UK3,Lajuana Vencill,GTX Plus Pro,Streethex,Lost,2017-04-23,2017-05-02,0.0

In [7]:
df3['sales_agent'].unique()

array(['Moses Frase', 'Darcel Schlecht', 'Zane Levy', 'Anna Snelling',
       'Vicki Laflamme', 'Markita Hansen', 'Niesha Huffines',
       'James Ascencio', 'Gladys Colclough', 'Maureen Marcano',
       'Hayden Neloms', 'Rosalina Dieter', 'Versie Hillebrand',
       'Daniell Hammack', 'Elease Gluck', 'Violet Mclelland',
       'Kami Bicknell', 'Rosie Papadopoulos', 'Kary Hendrixson',
       'Reed Clapper', 'Wilburn Farren', 'Garret Kinder',
       'Marty Freudenburg', 'Cassey Cress', 'Lajuana Vencill',
       'Boris Faz', 'Donn Cantrell', 'Corliss Cosme', 'Cecily Lampkin',
       'Jonathan Berthelot'], dtype=object)

In [8]:
df3.groupby(['sales_agent'])['close_value'].sum()

sales_agent
Anna Snelling          275056.0
Boris Faz              261631.0
Cassey Cress           450489.0
Cecily Lampkin         229800.0
Corliss Cosme          421036.0
Daniell Hammack        364229.0
Darcel Schlecht       1153214.0
Donn Cantrell          445860.0
Elease Gluck           289195.0
Garret Kinder          197773.0
Gladys Colclough       345674.0
Hayden Neloms          272111.0
James Ascencio         413533.0
Jonathan Berthelot     284886.0
Kami Bicknell          316456.0
Kary Hendrixson        454298.0
Lajuana Vencill        194632.0
Markita Hansen         328792.0
Marty Freudenburg      291195.0
Maureen Marcano        350395.0
Moses Frase            207182.0
Niesha Huffines        176961.0
Reed Clapper           438336.0
Rosalina Dieter        235403.0
Rosie Papadopoulos     230169.0
Versie Hillebrand      187693.0
Vicki Laflamme         478396.0
Violet Mclelland       123431.0
Wilburn Farren         157640.0
Zane Levy              430068.0
Name: close_value, dtype: float64

In [9]:
df4.sample(5)

          sales_agent        manager regional_office
26     Markita Hansen   Celia Rouche            West
18       Cassey Cress  Rocco Neubert            East
6   Marty Freudenburg  Melvin Marxen         Central
23     Vicki Laflamme   Celia Rouche            West
17    Daniell Hammack  Rocco Neubert            East

In [10]:
df3[(df3['sales_agent']=='Darcel Schlecht') & (df3['deal_stage']=='Won')]['close_value'].sum()

1153214.0

In [11]:
df3[(df3['sales_agent']=='Darcel Schlecht') & (df3['deal_stage']=='Won')]['close_value'].count()

349

In [12]:
df3[(df3['sales_agent']=='Darcel Schlecht') & (df3['deal_stage']=='Won')]['close_value'].sum()/df3[(df3['sales_agent']=='Darcel Schlecht') & (df3['deal_stage']=='Won')]['close_value'].count()

3304.3381088825213

In [16]:
df3[(df3['sales_agent']=='Darcel Schlecht')]['close_value'].sum()/df3[(df3['sales_agent']=='Darcel Schlecht')]['close_value'].count()

2085.3779385171792

In [13]:
pd.read_csv("data_dictionary.csv")

,Table,Field,Description
0,accounts,account,Company name
1,accounts,sector,Industry
2,accounts,year_established,Year Established
3,accounts,revenue,Annual revenue (in millions of USD)
4,accounts,employees,Number of employees
5,accounts,office_location,Headquarters
6,accounts,subsidiary_of,Parent company
7,products,product,Product name
8,products,series,Product series
9,products,sales_price,Suggested retail price
10,sales_teams,sales_agent,Sales agent
11,sales_teams,manager,Respective sales manager
12,sales_teams,regional_office,Regional office
13,sales_pipeline,opportunity_id,Unique identifier
14,sales_pipeline,sales_agent,Sales agent
15,sales_pipeline,product,Product name
16,sales_pipeline,account,Company name
17,sales_pipeline,deal_stage,Sales pipeline stage (Prospecting > Engaging >...
18,sales_pipeline,engage_date,"Date in which the ""Engaging"" deal stage was in..."
19,sales_pipeline,close_date,"Date in which the deal was ""Won"" or ""Lost"""
20,sales_pipeline,close_value,Revenue from the deal

In [15]:
# Upload each DataFrame as a separate SQL table
df1.to_sql("accounts", engine, if_exists="replace", index=False)
df2.to_sql("products", engine, if_exists="replace", index=False)
df3.to_sql("sales_pipeline", engine, if_exists="replace", index=False)
df4.to_sql("sales_teams", engine, if_exists="replace", index=False)

In [11]:
print("CSV files uploaded as SQL tables successfully!")

CSV files uploaded as SQL tables successfully!